
#!/bin/sh
#*********************************************************
#　シェル名 : 16745201_test.sh
#  名　　称 : 16745201.shのテスト検証
#　説　　明 : 16745201.shの実施結果と想定結果のdiff確認
#　引　　数 : $1　自然数A
#　　　　 　  $2　自然数B
#             $3  想定の自然数AとBの最大公約数
#　戻 り 値 : 0　正常終了
#　　　　　   1　異常終了
#*********************************************************
#
#*********************************************************
#　変数の設定
#*********************************************************

EIJYOU_CODE=0
IJYOU_CODE=1
ARGS=3
tmp=/tmp/$$

#*********************************************************
#　引数の個数を確認する
#*********************************************************

if [ $# -ne "$ARGS" ]; then
    echo $(date "+%Y-%m-%d") "引数を三つ指定してください。"
    exit $IJYOU_CODE
fi

#*********************************************************
#　実施開始
#*********************************************************

if [[ $1 =~ ^[0-9]*[1-9][0-9]*$ && $2 =~ ^[0-9]*[1-9][0-9]*$ && $3 =~ ^[0-9]*[1-9][0-9]*$ ]]; then
    echo "GCD of $1 and $2 = $3" > $tmp-ans
else
    echo "$3" > $tmp-ans
fi

./16745201.sh $1 $2 > $tmp-out

diff $tmp-ans $tmp-out > /dev/null

#*********************************************************
#　テスト終了
#*********************************************************

if [ "$?" -eq "0" ]; then
    echo "実施結果 : OK!"
    echo "16745201.shの実施結果は想定結果と同じです。"
    echo "＼(*⌒0⌒)♪"
    rm -f $tmp-*
    exit $EIJYOU_CODE
else
    echo "実施結果 : NG!"
    echo "16745201.shの実施結果と想定結果が違います。"
    echo "(＞人＜;)"
    rm -f $tmp-*
    exit $IJYOU_CODE
fi
